Revit 2027 API
ParameterTypeId.SheetAssemblyManufacturer Property
 "Assembly: Manufacturer"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SheetAssemblyManufacturer { get; }
Public Shared ReadOnly Property SheetAssemblyManufacturer As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SheetAssemblyManufacturer {
	ForgeTypeId^ get ();
}
static member SheetAssemblyManufacturer : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace